# StructuralMaterialAssetInvalid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralAssetFailures..::..StructuralMaterialAssetInvalid Property
BuiltInFailures..::..StructuralAssetFailures Class See Also
---
Material assigned to the Analytical Element does not contain Structure parameters - verify material content.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralMaterialAssetInvalid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralMaterialAssetInvalid As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralMaterialAssetInvalid {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralAssetFailures Class
Autodesk.Revit.DB Namespace